src/Catalogs/ВидыНачисленийИУдержаний/ВидыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНачисленийИУдержаний</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>Взносы в ПФР  с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Взносы в ПФР- накопительная часть(до 2014 года)</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Взносы в ПФР- страховая часть(до 2014 года)</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Взносы в ФСС (временная нетрудоспособность)</description>
    </items>
    <items>
      <name>ФССНесчастныеСлучаи</name>
      <description>Взносы в ФСС (несчастные случаи)</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Взносы в ФФОМС</description>
    </items>
    <items>
      <name>ВзносыПоЕдиномуТарифу</name>
      <description>Взносы по единому тарифу</description>
    </items>
    <items>
      <name>НалогНаДоходы</name>
      <description>Налог на доходы</description>
    </items>
    <items>
      <name>ПогашениеЗаймаИзЗарплаты</name>
      <description>Погашение займа из зарплаты</description>
    </items>
    <items>
      <name>ПремияЗаПродажи</name>
      <description>Премия за продажи</description>
    </items>
    <items>
      <name>ПроцентыПоЗайму</name>
      <description>Проценты по займу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата</description>
    </items>
    <items>
      <name>СдельнаяОплатаПроцент</name>
      <description>Сдельная оплата (процент)</description>
    </items>
    <items>
      <name>ФиксированнаяСумма</name>
      <description>Сдельная оплата (фиксированная сумма)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.КодыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаПоСтраховымВзносам</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносамУНФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КодыДоходовНДФЛ/КодыДоходовНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыДоходовНДФЛ</name>
  <predefined>
    <items>
      <name>Код2000</name>
      <description>Вознаграждение за выполнение трудовых или иных обязанностей; денежное содержание и иные налогооблагаемые выплаты военнослужащим и приравненным к ним</description>
    </items>
    <items>
      <name>Код2010</name>
      <description>Выплаты по договорам гражданско-правового характера (за исключением авторских вознаграждений)</description>
    </items>
    <items>
      <name>Код2012</name>
      <description>Суммы отпускных выплат</description>
    </items>
  </predefined>
  <attributes>
    <name>СтавкаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДФЛПовышенная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыДоходовПоСтраховымВзносамУНФ/ВидыДоходовПоСтраховымВзносамУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДоходовПоСтраховымВзносамУНФ</name>
  <predefined>
    <items>
      <name>ПособияЗаСчетФСС</name>
      <description>Государственные пособия обязательного социального страхования, выплачиваемые за счет ФСС</description>
    </items>
    <items>
      <name>ПособияЗаСчетФСС_НС</name>
      <description>Государственные пособия по обязательному страхованию от несчастных случаев и профзаболеваний</description>
    </items>
    <items>
      <name>ДенежноеДовольствиеВоеннослужащих</name>
      <description>Денежное довольствие военнослужащих и приравненных к ним лиц рядового и начальствующего состава МВД и других ведомств</description>
    </items>
    <items>
      <name>ДенежноеСодержаниеПрокуроров</name>
      <description>Денежное содержание прокуроров, следователей и судей, не облагаемое страховыми взносами в ПФР</description>
    </items>
    <items>
      <name>ДоговорыГПХ</name>
      <description>Договоры гражданско-правового характера</description>
    </items>
    <items>
      <name>ДоходыСтудентовЗаРаботуВСтудотрядеПоГражданскоПравовомуДоговору</name>
      <description>Доходы студентов за работу в студотряде по гражданско-правовому договору</description>
    </items>
    <items>
      <name>ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору</name>
      <description>Доходы студентов за работу в студотряде по трудовому договору</description>
    </items>
    <items>
      <name>НеЯвляетсяОбъектом</name>
      <description>Доходы, не являющиеся объектом обложения страховыми взносами </description>
    </items>
    <items>
      <name>НеОблагаетсяЦеликом</name>
      <description>Доходы, целиком не облагаемые страховыми взносами, кроме пособий за счет ФСС и денежного довольствия военнослужащих</description>
    </items>
    <items>
      <name>ОблагаетсяЦеликом</name>
      <description>Доходы, целиком облагаемые страховыми взносами</description>
    </items>
    <items>
      <name>АвторскиеИсполнениеПроизведений</name>
      <description>Исполнение произведений литературы и искусства</description>
    </items>
    <items>
      <name>МатпомощьПриРожденииРебенка</name>
      <description>Материальная помощь при рождении ребенка, облагаемая страховыми взносами частично</description>
    </items>
    <items>
      <name>Матпомощь</name>
      <description>Материальная помощь, облагаемая страховыми взносами частично </description>
    </items>
    <items>
      <name>АвторскиеОткрытия</name>
      <description>Открытия, изобретения и создание промышленных образцов (процент суммы дохода, полученного за первые два года использования)</description>
    </items>
    <items>
      <name>АвторскиеАудиовизуальныеПроизведения</name>
      <description>Создание аудиовизуальных произведений (видео-, теле- и кинофильмов)</description>
    </items>
    <items>
      <name>АвторскиеДругиеМузыкальныеПроизведения</name>
      <description>Создание других музыкальных произведений, в том числе подготовленных к опубликованию</description>
    </items>
    <items>
      <name>АвторскиеЛитературныеПроизведения</name>
      <description>Создание литературных произведений, в том числе для театра, кино, эстрады и цирка</description>
    </items>
    <items>
      <name>АвторскиеМузыкальноСценическиеПроизведение</name>
      <description>Создание музыкально-сценических произведений (опер, балетов и др.), симфонических, хоровых, камерных, оригинальной музыки для кино и др.</description>
    </items>
    <items>
      <name>АвторскиеНаучныеТруды</name>
      <description>Создание научных трудов и разработок</description>
    </items>
    <items>
      <name>АвторскиеСкульптуры</name>
      <description>Создание произведений скульптуры, монументально- декоративной живописи, декоративно-прикладного и оформительского искусства, станковой живописи и др.</description>
    </items>
    <items>
      <name>АвторскиеГрафическиеПроизведения</name>
      <description>Создание художественно-графических произведений, фоторабот для печати, произведений архитектуры и дизайна</description>
    </items>
  </predefined>
  <attributes>
    <name>ВходитВБазуПФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВБазуФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВБазуФОМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыНалогов/ВидыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалогов</name>
  <predefined>
    <items>
      <name>АвансовыйПлатежПриУСНРасходы</name>
      <description>Авансовый платеж УСН (доходы минус расходы)</description>
    </items>
    <items>
      <name>АвансовыйПлатежПриУСН</name>
      <description>Авансовый платеж УСН (доходы)</description>
    </items>
    <items>
      <name>ЕдиныйНалогПриУСНРасходы</name>
      <description>Единый налог УСН (доходы минус расходы)</description>
    </items>
    <items>
      <name>ЕдиныйНалогПриУСН</name>
      <description>Единый налог УСН (доходы)</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>Единый налог(ЕНВД)</description>
    </items>
    <items>
      <name>ЕдиныйНалоговыйПлатеж</name>
      <description>Единый налоговый платеж</description>
    </items>
    <items>
      <name>НалогНаПрибыль</name>
      <description>Налог на прибыль</description>
    </items>
    <items>
      <name>АУСН</name>
      <description>Налог при АУСН</description>
    </items>
    <items>
      <name>Патент</name>
      <description>Налог с патента</description>
    </items>
    <items>
      <name>НДС</name>
      <description>НДС</description>
    </items>
    <items>
      <name>НДФЛСотрудники</name>
      <description>НДФЛ исчисленный налоговым агентом</description>
    </items>
    <items>
      <name>НДФЛДоходыСвышеПредельнойВеличины</name>
      <description>НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом</description>
    </items>
    <items>
      <name>ПФРСтраховаяСотрудники</name>
      <description>Страховые взносы в ПФР (до 2023 года)</description>
    </items>
    <items>
      <name>ПФРНакопительнаяСотрудники</name>
      <description>Страховые взносы в ПФР, накопительная часть по сотрудникам (до 2014 г)</description>
    </items>
    <items>
      <name>ФССТравматизмСотрудники</name>
      <description>Страховые взносы в ФСС от несчастных случаев</description>
    </items>
    <items>
      <name>ФОМССотрудники</name>
      <description>Страховые взносы в ФФОМС (до 2023 года)</description>
    </items>
    <items>
      <name>ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф</name>
      <description>Страховые взносы единый тариф ИП</description>
    </items>
    <items>
      <name>ПФРСвыше300ТР</name>
      <description>Страховые взносы ИП с дохода свыше предела</description>
    </items>
    <items>
      <name>ФСССотрудники</name>
      <description>Страховые взносы на обязательное социальное страхование</description>
    </items>
    <items>
      <name>СтраховыеВзносыЕдиныйТариф</name>
      <description>Страховые взносы по единому тарифу</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Фиксированные взносы в ПФР (до 2023 года)</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Фиксированные взносы в ПФР, накопительная часть (до 2014 г)</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>Фиксированные взносы в ТФОМС</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Фиксированные взносы в ФФОМС (до 2023 года)</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалога</name>
    <comment>Заполняется для поставляемых данных</comment>
    <type>
      <types>EnumRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещению</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежаИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыНачисленийИУдержаний/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// Виды начислений
	ГруппаНачисление = Элементы.Добавить();
	ГруппаНачисление.Наименование = НСтр("ru='Начисления'");
	ГруппаНачисление.ЭтоГруппа = Истина;
	ГруппаНачисление.Ссылка = Справочники.ВидыНачисленийИУдержаний.ПолучитьСсылку(Новый УникальныйИдентификатор);
	
	ГруппаУдержание = Элементы.Добавить();
	ГруппаУдержание.Наименование = НСтр("ru='Удержания'");
	ГруппаУдержание.ЭтоГруппа = Истина;
	ГруппаУдержание.Ссылка = Справочники.ВидыНачисленийИУдержаний.ПолучитьСсылку(Новый УникальныйИдентификатор);
	
	// Оклад по дням
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по дням (производственный календарь)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДней]";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
	Элемент.Используется 		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Оклад по часам
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по часам (производственный календарь)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
	Элемент.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасов]";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
	Элемент.Используется 		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Оклад по дням Графики
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по дням (график работы сотрудника)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
	Элемент.Используется 		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Оклад по часам Графики
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по часам (график работы сотрудника)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
	Элемент.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
	Элемент.Используется 		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Оплата по заданиям
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оплата по заданиям'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасовПоЗаданиям]";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
	Элемент.Используется 		= ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаРаботу");
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Процент от продаж по ответственному
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Процент от продаж по ответственному'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "[СуммуПродажПоОтветственному]  / 100 *  [ТарифнаяСтавка]";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
	Элемент.Используется 		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Оплата по сдельным нарядам
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СдельнаяОплата";
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Сдельная оплата (тариф)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "";
	Элемент.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2010;
	Элемент.Используется		= ОбщегоНазначенияУНФ.ЭтоУНФ();
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ДоговорыГПХ;
	
	// Сдельная оплата процентом
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СдельнаяОплатаПроцент";
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Сдельная оплата (% от суммы)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "";
	Элемент.КодДоходаНДФЛ 		= Справочники.КодыДоходовНДФЛ.Код2010;
	Элемент.Используется		= ОбщегоНазначенияУНФ.ЭтоУНФ();
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ДоговорыГПХ;
	
	// Фиксированная сумма
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФиксированнаяСумма";
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Сдельная оплата (фиксированная сумма)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "[ФиксированнаяСумма]";
	Элемент.КодДоходаНДФЛ 		= Справочники.КодыДоходовНДФЛ.Код2010;
	Элемент.Используется		= ОбщегоНазначенияУНФ.ЭтоУНФ();
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ДоговорыГПХ;
	
	// Отпускные
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Отпускные'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "";
	Элемент.КодДоходаНДФЛ 		= Справочники.КодыДоходовНДФЛ.Код2012;
	Элемент.Используется		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Премия продавцам
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПремияЗаПродажи";
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru = 'Премия продавцам за продажи'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "";
	Элемент.КодДоходаНДФЛ 		= Справочники.КодыДоходовНДФЛ.Код2010;
	Элемент.Используется		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Налог на доходы
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НалогНаДоходы";
	Элемент.Родитель 			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Налог на доходы'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула 			= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.НДФЛСотрудники;
	
	// ПФР по суммарному тарифу
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПФРПоСуммарномуТарифу";
	Элемент.Родитель 			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы в ПФР  с 1 января 2014 года'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула 			= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	
	// ПФР накопительная
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПФРНакопительная";
	Элемент.Родитель 			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы в ПФР- накопительная часть(до 2014 года)'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула 			= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники;
	
	// ПФР страховая
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПФРСтраховая";
	Элемент.Родитель			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы в ПФР- страховая часть(до 2014 года)'");
	Элемент.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	
	// ФСС
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФСС";
	Элемент.Родитель			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы в ФСС (временная нетрудоспособность)'");
	Элемент.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.ФСССотрудники;
	
	// ФСС несчастные случаи
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФССНесчастныеСлучаи";
	Элемент.Родитель			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы в ФСС (несчастные случаи)'");
	Элемент.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.ФССТравматизмСотрудники;
	
	// ФФОМС
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФФОМС";
	Элемент.Родитель			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы в ФФОМС'");
	Элемент.Тип					= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.ФОМССотрудники;
	
	// Погашение займа из зарплаты
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПогашениеЗаймаИзЗарплаты";
	Элемент.Родитель			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Погашение займа из зарплаты'");
	Элемент.Тип					= Перечисления.ТипыНачисленийИУдержаний.Удержание;
	Элемент.Используется 		= ОбщегоНазначенияУНФ.ЭтоУНФ();
	
	// Погашение проценты по займу
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПроцентыПоЗайму";
	Элемент.Родитель			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Проценты по займу'");
	Элемент.Тип					= Перечисления.ТипыНачисленийИУдержаний.Удержание;
	Элемент.Используется 		= ОбщегоНазначенияУНФ.ЭтоУНФ(); 
	
	// Взносы по единому тарифу
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВзносыПоЕдиномуТарифу";
	Элемент.Родитель 			= ГруппаУдержание.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Взносы по единому тарифу'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Налог;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула 			= "";
	Элемент.Используется		= Истина;
	Элемент.ВидНалога = Справочники.ВидыНалогов.СтраховыеВзносыЕдиныйТариф;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидНалога");
	Результат.Добавить("Тип");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

Процедура ДополнитьВидыНачислений() Экспорт
		
		Группа = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Начисления");
		
		Если Не ЗначениеЗаполнено(Группа) ИЛИ НЕ Группа.ЭтоГруппа Тогда
			ГруппаНачисление = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
		Иначе
			ГруппаНачисление = Группа;
		КонецЕсли;
		
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Оклад по дням (график работы сотрудника)");
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по дням Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= "Оклад по дням (график работы сотрудника)";
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
			НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли;
		
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Оклад по часам (график работы сотрудника)");
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по часам Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= "Оклад по часам (график работы сотрудника)";
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
			НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли
		
КонецПроцедуры

// Процедура - Установить признак использования при обновлении
//
Процедура УстановитьПризнакИспользованияПриОбновлении() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВидыНачисленийИУдержаний.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
		|ГДЕ
		|	НЕ ВидыНачисленийИУдержаний.ЭтоГруппа";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектНачисления = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектНачисления.Заблокировать();
			ОбъектНачисления.Используется = Истина;
			ОбъектНачисления.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		СообщениеОбОшибке = НСтр("ru='Установить признак используется для видов начислений'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
			
		ЗаписьЖурналаРегистрации(СообщениеОбОшибке, УровеньЖурналаРегистрации.Ошибка, , , 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СобственныйВызов") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Параметры.Вставить("СобственныйВызов");
		Отбор = Новый Структура;
		Отбор.Вставить("Используется", Истина);
		Параметры.Вставить("Отбор", Отбор);
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
